nxp-mcuxpresso/mcuxsdk-examples/_boards/twrmc56f8400/driver_examples/i2c/polling_b2b_transfer/slave/pin_mux.c
/*
 * Copyright 2020-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v10.0
processor: MC56F84789
package_id: MC56F84789VLL
mcu_data: ksdk2_0
processor_version: 0.10.4
board: TWR-MC56F8400
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '62', peripheral: QSCI1, signal: TXD, pin_signal: GPIOF4/TXD1/XB_OUT8}
  - {pin_num: '63', peripheral: QSCI1, signal: RXD, pin_signal: GPIOF5/RXD1/XB_OUT9}
  - {pin_num: '88', peripheral: I2C0, signal: SCL, pin_signal: GPIOC15/SCL0/XB_OUT5, open_drain: enable}
  - {pin_num: '87', peripheral: I2C0, signal: SDA, pin_signal: GPIOC14/SDA0/XB_OUT4, open_drain: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* Enable peripheral functionality on pin GPIOC14 (pin 87) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin14, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC14 (pin 87) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C14_SDA0);
    /* Enable peripheral functionality on pin GPIOC15 (pin 88) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin15, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC15 (pin 88) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C15_SCL0);
    /* Enable peripheral functionality on pin GPIOF4 (pin 62) */
    GPIO_PinSetPeripheralMode(GPIOF, kGPIO_Pin4, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF4 (pin 62) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F4_TXD1);
    /* Enable peripheral functionality on pin GPIOF5 (pin 63) */
    GPIO_PinSetPeripheralMode(GPIOF, kGPIO_Pin5, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF5 (pin 63) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F5_RXD1);

    /* Pin configuration on GPIOC14 (pin 87) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(GPIOC, kGPIO_Pin14, kGPIO_OutputOpenDrain);

    /* Pin configuration on GPIOC15 (pin 88) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(GPIOC, kGPIO_Pin15, kGPIO_OutputOpenDrain);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
